// 1.   տպել նախադասությունը հակառակ հաջորդականությամբ (օրինակ ներմուծված է “բարև Հայաստան շուտվանից չէինք հանդիպել” պետք է արտածվի “հանդիպել չէինք շուտվանից Հայաստան բարև”)

// let func = s => {
//     if(typeof s !== "string")return "invalid value";
//   return  s.split(" ").reverse().join(" ");
// }
// console.log(func("Es im anush Hayastani arevaham barn em sirum"));

//______________________________________________________________________________________________

// 2․ունենալ կամայական զանգված,ստեղծել այնպիսի ֆունկցիա, որը ստանում է 2 արգումենտ և Օրինակ եթե ֆունկցիան կանչենք այսպես =>  (myFunc([1.2.3.4.5],[4.5])),այն պետք է վերադարձնի [1,2,3], այսինքն առաջին զանգվածից ջնջի 4 և 5-ը

// let myFunc = (a,b) => {
//     for(let i = 0;i < b.length; i++){
//         if(a.indexOf(b[i]) >= 0){
//             a.splice(a.indexOf(b[i]),1)
//         }
//     }
// return a;
// }
// console.log(myFunc([1,2,3,4,5],[1,2,3]))